app/controllers/employee_positions_controller.rb

  def index
    @employee_positions = EmployeePosition.all
---
SELECT "employee_positions".* FROM "employee_positions"

  def create
    @employee_position = EmployeePosition.new(employee_position_params)

    respond_to do |format|
      if @employee_position.save
---
INSERT INTO "employee_positions" ("created_at", "employee_id", "organization_id", "position_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 22 Aug 2014 19:20:35 UTC +00:00], ["employee_id", 1], ["organization_id", 1], ["position_id", 1], ["updated_at", Fri, 22 Aug 2014 19:20:35 UTC +00:00]]

    def set_employee_position
      @employee_position = EmployeePosition.find(params[:id])
---
SELECT "employee_positions".* FROM "employee_positions" WHERE "employee_positions"."id" = ? LIMIT 1  [["id", "1"]]