app/controllers/organizations_controller.rb

INSERT INTO "organizations" ("created_at", "key_code", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 23 Aug 2014 21:34:53 UTC +00:00], ["key_code", "ce4b9f1e"], ["name", "Sweetest Org"], ["updated_at", Sat, 23 Aug 2014 21:34:53 UTC +00:00]]
---
  def create
    @organization = Organization.new(organization_params)

    respond_to do |format|
      if @organization.save